Приветствую всех на данном материале по CTF,  сегодня мы попробуем взломать машину Brooklyn Nine Nine, машина имеет легкий уровень сложности и проходится по словам разработчика за 25 минут

![[{EB36BE51-2518-4218-8638-19EE631E16B7}.png]]

разработчик утверждает что есть два основных способа получить рут на это машине, нам сегодня предстоит узнать какой именно способ мы сможем найти, начнем с базовой разведки, пропишем команду

```
nmap -sV -sS 10.113.133.203
```

мы видим следующее

![[{7CAD0571-8B6C-406F-9477-FA0A8D7C571F}.png]]

3 стандартных незашифрованных порта которые довольно часто встречаются в уязвимых машинах, так как это не пособие по решению данной машины а лишь моя попытка её решить, здесь вы можете видеть мой мыслительный процесс и попытки разобраться, так же вы можете встретить ошибки новичка но попрошу быть ко мне более снисходительным)

Хорошо, лично я вижу возможность попробовать зайти на сайт и попробовать поискать возможные коментарии или следы оставленные в html, давайте попробуем сделать это

![[{3BBE7451-54F6-4BF4-94AC-A255045D3F6F}.png]]

предполагаю что это обложка какого-то комедийного фильма или сериала, внизу мы видим надпись

**В этом примере создается фоновое изображение на всю страницу. Попробуйте изменить размер окна браузера, чтобы убедиться, что оно всегда будет занимать весь экран (если развернуть его кверху) и что оно хорошо масштабируется при любых размерах экрана.**

перевод немного корявый но основной смысл понятен, как бы я не крутил колесиком мыши изображение остается неизменным по размеру, текст в свою очередь меняет своё значение, соответственно за этим изображением как я подозреваю находится что-то интересное, я думаю нам надо поменять какое то значение в браузере на клиентской стороне для того чтобы мы могли посмотреть что за этим изображением

я попробовал зайти в style editor и покрутить разные настройки но это  не принесло какого-то успеха ![[{C9D2211D-C177-4C0D-A9CE-31C7B7585DB4}.png|697]]

я уверен в том что загадка связана с размером данного изображения, но повертев все параметры размера и расположения я понял что можно попробовать зайти через другие пути так как у нас еще несколько открытых портов, в выводе nmap мы наблюдали 21 открытый порт ftp по которому можно попробовать подключится что мы и сделали

![[{D3009950-1CB0-412A-8100-BE509650B4BC}.png]] 

достаточно часто мы можем войти в уязвимых машинах на порт фтп через логин anonymous что мы и протестировали, после этого я не стал просто вводить пароль и нажал enter и это сработало 

![[{160CF764-C497-40A1-B0A4-2BDA8BBBBF70}.png]]

Решил проверить что у нас находится внутри с помощью команды ls я увидел что есть какой то текстовой файл, убедившись что  я не могу посмотреть файл тут, я решил его скачать, после этого я выхожу и с помощью cat смотрю что написано в этом файле

![[{6F101D59-E29A-4845-AFF3-8BD3120D7115}.png]]

Судя по сообщению от Эми в контексте, она просит поменять Джейка свой пароль так как он является слабым, так как ssh у нас открыт и это является протоколом удаленного доступа мы можем попробовать забрутфорсить пароль Джейка через Hydra, давайте попробуем это сделать
прописываем команду

```
hydra -l Jake -P rockyou.txt 10.113.133.203 -t 16 ssh
```

Будем пробовать брутфорсить через стандартный список слов rockyou.txt и запустим 16 потоков с помощью флага -t 

Так как брутфорс требует больше времени чем мне это казалось возможно из за не совсем удачного списка слов, я посмотрел код страницы сайта и увидел очень занимательную подсказку
![[{A86E9B08-A760-4634-A1F7-6DA217B97D20}.png]]

***слышал ли ты когда нибудь о стеганографии?***

Намёк явно на то что в изображении может быть что нибудь спрятано, воспользуемся гуглом и попробуем запустить какой нибудь инструмент на кали линукс который поможет нам узнать что находится внутри данного изображения, но для начала нам надо его скачать

После того как я скачал изображение я решил открыть его с помощью команды cat
но увидев куча непонятного, я начал листать его в надежде увидеть какую то зацепку, что к сожалению пока мне не удалось ![[{AAB39292-178A-4901-9BCB-F74E2EA9CC85}.png]]

Но я не отчаялся и после вопроса гуглу он мне посоветовал инструмент на кали линукс который называется steghide, попробовав вытащить что то с этого изображения он у меня запросил passphrase, на что я просто нажал enter и к сожалению во второй раз такая уловка не сработала, 

Вот тут я действительно немного застрял, но это не означает что мои идеи подошли к концу,
брутфорс идёт достаточно долго что вызывает подозрения, но мы не будем полагаться только на это, возможно если мы попробуем разведать через gobuster скрытые каталоги сайта, может быть там мы найдем что то интересное, давайте попробуем

Введём следующую команду

```
gobuster dir -u "http://10.113.133.203/" -w /usr/share/wordlists/dirbuster/directory-list-2.3-medium.txt -r
```

Мой любезный друг подсказал мне одну ошибку связанную с брутфорсом пароля на гидре, к сожалению не обладая достаточным опытом я решил вести имя Джейк для брутфорса с большой буквы, а не с маленькой как это было нужно, благодаря ему пароль мы все же подобрали
![[{73C1B523-58AD-4148-9AB7-E8139141C6FA}.png]]

Давайте же подключимся по ssh к этому профилю

![[{494C0C0F-4C3F-4977-9964-3FEE4045B5D0}.png]]

Сколько времени я потратил на гобастер и на брутфорс вы бы знали, но не об этом, по итогу мы вошли под Джейком и можем свободно двигаться по его системе, при команде ls в директории /home/jake не было ни одного файла
кстати если кому интересно то гобастер не нашёл ничего интересного, возможно потому что это была просто html страница а я что-то себе надумал
![[{3572AC3D-843D-4905-B5E1-BEB661FFF21D}.png]]
Хорошо, продолжаем разбираться в файлах Джейка, по пути в /home/holt мы увидели два файла
![[{2DCB0923-43D4-4519-8FE6-AAEB934E43A3}.png]]
В user.txt  был какой то зашифрованный ключ, возможно он нам пригодится в будущем для эскалации привилегий или для того чтобы вытащить секретный файл из  картинки, я решил посмотреть что нам выдало и ввести этот хеш в CrackStation, результат меня очень приятно удивил
![[{5780AD40-4C30-4E47-9AD7-1769D44FBA2A}.png]]

Это отличная находка и она нам очень пригодится, давайте попробуем вставить это в steghide
![[{4C552A0E-B569-4542-BA87-65992B9F3A50}.png]]

К сожалению ничего не получилось, но возможно это можно как-то использовать для эскалации привилегий,

Забудьте мой смехотворный вывод о том что это можно как-то использовать, оказывается это был просто флаг, как оказалось часть задания была уже выполнена, вот первый флаг 
![[{02524F36-2259-4714-8438-695BD25CD17C}.png]]

По итогу мы находимся под эгидой Джейка и нам нужно получить рут, давайте зададим вопрос как он может писать команды от имени рута
![[{33342DF5-40FF-4910-8035-B24E4B9EEF32}.png]]

И тут мы видим что Джейк может запускать утилиту less без суперпользователя, давайте же загуглим данную строку
мы попадаем на сайт gtfobins и видим что мы можем провести эскалацию привилегий
![[{7732736F-DBD4-4E2F-AF44-D91BD301960B}.png]]

Абсолютно неважно что мы запустим главное сделать это с помощью утилиты less хоть пустой ввод, мы попадем в интерактивный текст и мы просто вводим последнюю строку 
```
!/bin/sh
```

И мы возвращаемся в командную строку, давайте спросим под каким пользователем мы находимся
![[{1D1B3309-F41A-4FB0-8647-F756A1793667}.png]]
Осталось дело за малым, обычно флаги рута находятся в каталоге /root давайте же посмотрим что там есть

![[{D7433F7F-D842-437E-BA71-C60777CCE7D3}.png]]

Поздравляю! мы наконец-то нашли последний флаг  уязвимой машины, благодаря моему другу с его подсказкой а так же благодаря гуглу мы смогли провести правильно брутфорс через открытый порт на ssh, а так же смогли повысить свои привелегии до рута, благодарю вас мой читатель за то что вы прошли со мной такой непростой для меня путь

## Lessons Learned
Если говорить простым языком здесь мы с вами наблюдаем 3 уязвимости который позволили поэтапно мне получить суперпользователя

1 ошибка - плохой пароль у Джейка
2 ошибка - излишнее доверие к пользователю 
3 ошибка - открытый порт ftp с которого можно загрузить файл зайдя под anonymous без пароля

Разберемся поэтапно
**1 ошибка** - у пользователя jake стоит очень слабый пароль 987654321 который находится в любом хакерском словаре по умолчанию, Hydra нам позволила спокойно стучаться в дверь бесконечное количество раз пока мы не подобрали пароль,

**Главный вывод** - безопасность всей системы находится под угрозой даже если у 1 сотрудника стоит ненадежный пароль

**Как это исправить** - Запретить ставить слабые пароли которые могут находится в вордлисте,

Поставить специальную программу которая будет считывать количество неудачных попыток и например после 5 раз будет блокировать данный ip адрес на несколько часов,

Вообще отказаться от паролей для входа по SSH и переключиться на специальные зашифрованные файлы-ключи.

**2 ошибка** - Опасные настройки админских прав (Sudo), когда мы зашли под пользователем jake мы посмотрели какие команды он может выполнять от суперпользователя, оказывается что он может выполнять команду less от суперпользователя не вводя пароль, казалось бы что это всего-лишь утилита для того чтобы смотреть текст, но внутри этой программы можно вызвать командную строку, и раз программа была запущена с правами суперпользователя то и и открывшаяся строка так же будет запущена с правами суперпользователя

**Главный вывод** - Нельзя давать пользователям повышенные права на программы, если вы до конца не знаете, как эти программы работают. Если утилита умеет делать хоть что-то, кроме своей основной задачи (например, открывать другие приложения), хакер использует это против вас.

**Как это исправить** - Отобрать у пользователя jake право запускать less от имени администратора, для обычной работы ему это просто не нужно,
Давать сотрудникам доступ только к тем файлам и кнопкам которые им необходимы для выполнения их задач

**3 ошибка** - Мы зашли на порт ftp без пароля под стандартным логином anonymous 
и скачали файл который дал нам информацию о пользователе

**Главный вывод**  - Нельзя оставлять внутренние серверы открытыми для интернета даже если кажется что там нет ничего скрытного, любая зацепка облегчает злоумышленнику взлом

**Как это исправить** - Полностью отключить анонимный вход в настройках FTP-сервера,
Если файлы нужны сотрудникам, доступ должен быть строго по личным логинам и сложным паролям
Удалить все текстовые файлы с подсказками, именами и паролями из общедоступных мест.


